[
    {
      "category": "Projects",
      "name": "Generative AI chatbot called TanmayBOT",
      "details": "This personal project of mine is the one currently being used and where this request originates from. It is Retrieval-Augmented Generation (RAG) application built using Python, Flask, a Large Language Model (LLM), a cross-encoder model provided by the Sentence Transformers library, and React.js. It is a chatbot personification of me that answers questions about my life and background based on a knowledge base containing information about me. Its RAG technique entails using the ms-marco-MiniLM-L-12-v2 cross-encoder model to find the sections of the knowledge base most relevant to a query and then submits those sections along with the user query to gpt-5-chat-latest, an LLM. It was built and deployed in September 2025." 
    },
    {
      "category": "Projects",
      "name": "React.js app called Commute Comparor",
      "details": "This personal project of mine is a web app built with React.js and Google Maps's Routes API that lets users compare commutes (by car or public transit) from a generalized origin to a generalized destination across different cities. It is useful to anyone planning a trip, deciding where to move, or just curious to see how convenient (or not) their city is. It was built and deployed in August 2025. Here is a link to the app - https://commute-comparor.vercel.app/"
    },
    {
      "category": "Projects",
      "name": "A web app built with HTML, CSS, and JavaScript called 'Can you Beat your Computer at Bunco?'",
      "details": "This personal project of mine is a web app built with HTML, CSS, and JavaScript that lets users play the dice game Bunco against their computer. It includes game instructions, game logs, score tallying, and interactive dice. It was built and deployed in March 2025. Here is a link to the app - https://play-bunco-online.netlify.app/buncoui"
    },
    {
      "category": "Work Experience",
      "name": "Working at OpenRisk Technologies from July 2024 to August 2025",
      "details": "This was my most recent work experience. I started working at OpenRisk Technologies, an AI startup that licenses its Intelligent Document Processing (IDP) software to commercial banks, in July 2024 as a full-time software engineer with a focus on backend development of the IDP software using Python, Java, SQL, and SPARQL. I designed, enhanced, and developed many RESTful Spring Boot APIs across a Java-based microservices architecture, including APIs that execute SQL and SPARQL queries to conduct complex postgres database and RDF graph operations. I developed Python programs to extract interest periods from commercial loan contracts, automate the testing of loan covenant extractions, and enable users to safely cancel and reset the processing of stalled documents on the IDP platform. I also used Python and associated Natural Language Toolkit (NLTK) and Huggingface AI/ML libraries for Named Entity Recognition (NER), tokenization, and Reasoning for Complex Question Answering (RCQA) to debug and resolve issues with the Natural Language Processing (NLP) extractions of financial data from uploaded contracts. I gained some exposure to AWS and Docker while re-engineering model deployment pipelines by incorporating a storage service intermediary between AWS and containerized applications - I replaced direct file transfers from AWS to the containerized applications with programmatic Python downloads from the storage service. I also manually conducted regular and thorough regression and end-to-end testing of the OpenRisk IDP platform and collaborated closely with clients through daily calls, onsite meetings at their headquarters, and 1-1 debugging sessions."
    },
    {
      "category": "Work Experience",
      "name": "Fullstack Web Development Internship at World Wide Technology from May 2023 to August 2023",
      "details": "I was a Fullstack Web Development Intern at World Wide Technology's (WWT's) Advanced Technology Center (ATC). I was part of the team responsible for using Vue.js and Node.js to develop WWT's corporate website. During my internship, the team was working on implementing 'Learning Paths', which are educational courses that WWT offers on its website. In addition to building a feature allowing users to save Learning Paths to their profile, I completely revamped how a Learning Path is used and displayed on the mobile version of WWT's website by making its syllabus accessible on every page of the Learning Path and making navigation between pages much smoother. My internship capstone project entailed presenting a data-driven solution to track WWT's Scope 3 Carbon emissions that one first-place in the Internship capstone project - I used the carbon Life Cycle Assessment (LCA) of a particular Dell (a close partner of WWT) product to develop and demonstrate a replicable and scalable way to measure WWT's Scope 3 carbon emissions associated with ordering, assembling or modifying, and delivering that product. I worked in an agile environment and participated in agile ceremonies like daily stand-ups and sprint planning, review, and retrospective meetings. I also regularly demonstrated my work to stakeholders."
    },
    {
      "category": "Work Experience",
      "name": "Supply Chain Analytics Internship at World Wide Technology from May 2022 to August 2022",
      "details": "I was a Supply Chain Analytics Intern at World Wide Technology (WWT) from May 2022 to August 2022, and I worked with the team responsible for using Tableau to make and update visualizations of Supply Chain data. I enhanced and modified these visualizations in response to requests from teams relying on them and also analyzed these visualizations for trends and patterns in WWT's supply chain operations. Many ServiceNow tickets requesting us to make or modify a visualization had an incorrectly listed requester, and I investigated around 150 such tickets to find and input the correct one. My capstone project entailed designing and presenting to executives a data-driven solution to measure the assembly of equipment at WWT's Integration Centers in labor hours and hasten production. I also had the opportunity to tour these Integration Centers in Edwardsville, IL and directly observe and learn about WWT's supply chain operations."
    },
    {
      "category": "Skills",
      "name": "Python and AI/ML skills",
      "details":"Python for backend development and AI techniques is among my most important and most actively and recently used skills. In my most recent role as a software engineer at OpenRisk Technologies between July 2024 and August 2025, I heavily used Python to develop product features such as a rules-based extractor to extract interest periods from commercial loan contracts and an option to cancel the processing of and subsequently dequeue stalled documents so that other uploaded documents in the queue can continue processing. I also used Python to develop internal tools such as a program to automate the testing of loan covenants and to re-engineer internal pipelines such as the one between NLP models stored in AWS S3 and containerized (with Docker) applications - I incorporated a storage service intermediary between AWS and containerized applications and replaced direct file transfers with programmatic Python downloads from the storage service. I debugged and resolved issues with Natural Language Processing (NLP) extractions of financial data using Python, which often entailed re-training transformer models used for intent classification after discovering and adding missing intents to the model or modifying how questions were asked to Huggingface Reasoning for Complex Question Answering (RCQA) models. I built TanmayBOT by using Python, Flask, the ms-marco-MiniLM-L-12-v2 cross-encoder model, and a the gpt-5-chat-latest LLM to implement Retrieval Augmented Generation (RAG) with a knowledge base containing details about me."
    },
    {
      "category": "Skills",
      "name": "Java, SQL, and SPARQL skills",
      "details":"Using Java in conjunction with SQL and SPARQL for backend development is among my core and most actively and recently used skills. In my most recent role as a software engineer at OpenRisk Technologies between July 2024 and August 2025, I designed, enhanced, and developed many RESTful Spring Boot APIs across a Java-based microservices architecture, including APIs that execute SQL and SPARQL queries for complex postgreSQL database and Resource Description Framework (RDF) graph operations, respectively. I built from scratch a Spring Boot API that queries a PostgreSQL database to retrieve financial data extracted from all uploaded contracts and executes SQL queries and Java code to restructure the data in a way necessary to power an important datatable on the OpenRisk platform. I also made an integral enhancement to a Spring Boot API used to upload documents to the OpenRisk platform by enabling clients to assign customizable metadata to documents at the time of upload and storing that metadata in our RDF graphs. Creating and modifying postgreSQL tables to implement features and meet data storage requirements made me proficient in SQL and database management."
    },
    {
      "category": "Skills",
      "name": "skills in HTML, CSS, JavaScript and associated JavaScript frameworks",
      "details": "My personal web development projects and Fullstack Web Development Internship at World Wide Technology (WWT) from May 2023 to August 2023 have endowed me with skills in web development using HTML, CSS, and JavaScript and frameworks including React.js, Vue.js, and Node.js. I was part of the team responsible for using Vue.js and Node.js to develop and add features to WWT's corporate website, and the team was working on implementing 'Learning Paths', which are educational courses offered on WWT's website, during my internship. In addition to building a feature allowing users to save Learning Paths to their profile, I completely revamped how a Learning Path is used and displayed on the mobile version of WWT's website by making its syllabus accessible on every page of the Learning Path and making navigation between pages much smoother. I used HTML, CSS, and JavaScript to build 'Can you Beat your Computer at Bunco' (https://play-bunco-online.netlify.app/buncoui), a web application that allows users to play the dice game 'Bunco' against their computer. I used React.js to build 'Commute Comparor' (https://commute-comparor.vercel.app/), a web application that allows users to compare transit and driving routes from a generalized origin to a generalized destination across cities. I also used React.js to build the UI for TanmayBOT, whose backend was built by using Python, Flask and the ms-marco-MiniLM-L-12-v2 cross-encoder model to implement a Retrieval Augmented Generation (RAG) model that leverages the gpt-5-chat-latest LLM to generate responses."
    },
    {
      "category": "Skills",
      "name": "Data Science/Analytics and Finance skills",
      "details": "My work experience, educational background, and personal interests have equipped me with robust skills in Data Science and Analytics and in Finance. My most recent work experience at OpenRisk Technologies heavily involved PostgreSQL database and Resource Description Framework (RDF) graph operations that made me proficient in SQL and SPARQL. During my Supply Chain Analytics Internship at World Wide Technology in the summer of 2022, I was responsible for updating and creating Tableau visualizations of supply chain data and analyzing such visualizations for trends and patterns. My internship capstone project entailed presenting a data-driven solution to measure the assembly of equipment in WWT's Integration Centers in labor hours and hasten production. During my 2023 summer internship at WWT, I presented a data-driven solution to track WWT's Scope 3 Carbon emissions that one first-place in the Internship capstone project - I used the carbon Life Cycle Assessment (LCA) of a particular Dell (a close partner of WWT) product to develop and demonstrate a replicable and scalable way to measure WWT's Scope 3 carbon emissions associated with ordering, assembling or modifying, and delivering that product. My academic coursework, including courses in Statistics, Econometrics, and Calculus, have equipped me with a strong grasp of Regression analysis and Bayesian probability. Attaining my Bachelor's Degree in Economics at Grinnell College gave me the opportunity to apply these skills to the realm of Finance through courses such as Corporate Finance and submissions such as an event-study paper that uses Stata to investigate the impact of the Deepwater Horizon Oil Spill on the stock price of British Petroleum (https://docs.google.com/document/d/1OPqoCfxAreeMsDDvU4Nt_sOEclhnqvYokJwdJT09UMk/edit?tab=t.0). I was also an active participant in Grinnell College's Investment club, which invested a portion of the college's endowment in US-listed stocks, and was part of a successful pitch deck presentation to convince the club to invest in a particular stock. I will be furthering my passion for and skills in data by beginning an Executive Master of Science in Data Science and Analytics at New England College on November 10 2025 - this is a hybrid program designed for working professionals and will allow me to concurrently work full-time."
    },
    {
      "category": "Skills",
      "name": "Soft skills",
      "details": "This is an overview of my soft skills. I am an articulate and confident public speaker and presenter who has continuously honed that ability throughout my life, from elocution competitions in middle school to high-stakes presentations at the workplace. I was an active participant in public speaking engagements and competitions such as Model United Nations and Mock Trials in high school and college. During my Fullstack Web Development Internship at World Wide Technology (WWT) between May and August 2023, I was part of the team that won first-place in the Internship Capstone Project for presenting a solution to calculate WWT's Scope 3 carbon emissions. I also regularly demonstrated my development work to stakeholders. I have also acquired experience and proficiency in engaging with clients and customers. My most recent work experience at OpenRisk Technologies entailed closely collaborating with clients through daily meetings, 1-1 debugging sessions, and an in-person meeting at their corporate headquarters. Working part-time as a front-desk technical assistant at the IT Services department while pursuing my Bachelor's Degree at Grinnell College had me interact with and assist countless customers over the phone, through email, and in-person, and this experience made me adept at and taught me to enjoy customer service."
    },
    {
      "category": "Education", 
      "name": "Overview of my education",
      "details": "Here is an overview of my education. The most advanced degree(s) I have attained so far is a Bachelor of Arts in Computer Science and a Bachelor of Arts in Economics from Grinnell College. I attended Grinnell College between August 2020 and May 2024. I will begin pursuing an Executive Master of Science in Data Science and Analytics at New England College on November 10 2025 - this hybrid program is designed for working professionals and will allow me to concurrently work full-time. Prior to moving to the United States to pursue my Bachelor's Degree at Grinnell College, I attained an International Baccalaureate (IB) Diploma at the Li Po Chun United World College (LPCUWC) of Hong Kong. I attended LPCUWC between August 2018 and May 2020."
    },
    {
      "category": "Education",
      "name": "Executive Master of Science in Data Science and Analytics at New England College from November 2025 to August 2027",
      "details": "I will begin pursuing an Executive Master of Science in Data Science and Analytics at New England College on November 10 2025. This hybrid program is designed for working professionals and will allow me to concurrently work full-time anywhere in the United States. I will be eligible for Curricular Practical Training (CPT) with an earliest possible start date of November 10 2025. The program includes courses such as Data Mining and Statistical Modeling, Machine Learning, Text Analytics and Natural Language Processing, and Big Data Tools and Architecture."
    },
    {
      "category": "Education",
      "name": "Bachelor of Arts in Computer Science and Bachelor of Arts in Economics at Grinnell College from August 2020 - May 2024",
      "details": "Here is an overview of my time at Grinnell College. I began studying at Grinnell College in August 2020 and graduated in May 2024 with a Bachelor of Arts in Computer Science and a Bachelor of Arts in Economics. My Computer Science courses included Functional Problem Solving (with Racket), Imperative Problem Solving and Data Structures (with C), Algorithms and Object-Oriented Design (with Java), Analysis of Algorithms (using Java), and Software Design and Development (using R Shiny). My Economics courses and prerequisites included Applied Statistics, Calculus II, Econometrics, Corporate Finance, Microeconomics, Macroeconomics, Health Economics, and International Trade. Between October 2021 and May 2024, I worked part-time as a technical assistant at Grinnell College IT Services, where I was responsible for assisting college students, staff, and faculty with technical issues. I received customers in person and talked to them over the phone and via ServiceNow tickets to resolve issues with their personal devices, applications or softwares they were using, or their ability to use campus equipment such as printers or devices loaned out by Grinnell College IT Services. I also handled check-out and return transactions for loaned equipment and used ServiceNow to create and update detailed incident logs for precise documentation and follow-up. I was also an active participant in Mock Trial tournaments, the Badminton Club, and the investment club, which invested a portion of the college's endowment in US-listed stocks. I was part of a successful pitch deck presentation to convince the investment club to buy a particular company's stock."
    },
    {
      "category": "Education",
      "name": "International Baccalaureate Diploma at Li Po Chun United World College of Hong Kong between August 2018 and May 2020",
      "details": "My last 2 years of high school consisted of obtaining an International Baccalaureate (IB) Diploma between August 2018 and May 2020 at the Li Po Chun United World College (LPCUWC) of Hong Kong, an international residential school with students from over 80 countries and one of 18 schools worldwide in the United World College (UWC) network. I took Mathematics, Physics, and Economics at the Higher Level and English Language and Literature, Global Politics, and Mandarin Ab Initio at the Standard Level. I was an active participant in Model United Nations and Mock Trials tournaments and also led a student organization on campus that raised funds and secured donations for asylum-seekers and refugees in Hong Kong. I thoroughly enjoyed living in and exploring Hong Kong and making friends from all across the world."
    },
    {
      "category": "About Me",
      "name": "Introduction to me",
      "details": "Here is a brief introduction to me. My name is Tanmay Bothra, and I am a 23-year-old software engineer living in Brooklyn, New York. I grew up in Mumbai, India, finished my last 2 years of high school at an international residential school in Hong Kong, and moved to the United States to pursue my Bachelor's Degree at Grinnell College in Grinnell, Iowa. I graduated in May 2024 with a Bachelor of Arts in Computer Science and a Bachelor of Arts in Economics, and worked remotely as a software engineer at an AI start-up called OpenRisk Technologies between July 2024 and August 2025. I am looking for full-time roles or internships in software engineering, data science, or analytics with a start date of November 10. On November 10 2025, I will begin pursuing a hybrid Executive Master of Science in Data Science and Analytics - this program is designed for working professionals and will allow me to concurrently work full-time anywhere in the United States."
    },
    {
      "category": "About Me",
      "name": "Interest in outdoor activities",
      "details": "I enjoy outdoor activities, particularly hiking, camping, and skiing. My most recent hike was Mount Adams and Mount Madison in New Hampshire's White Mountain National Forest at the end of August. The best hike I've done is between the Yosemite Grand Tour Loop in Yosemite National Park and Angel's Landing in Zion National Park. I started skiing last winter and thoroughly enjoyed the experience - I was fortunate to be able to go to Arizona Snowbowl near Flagstaff, AZ and to Brian Head Ski Resort in Utah."
    },
    {
      "category": "About Me",
      "name": "Interest in traveling and history",
      "details": "I enjoy walking through and exploring new cities, particularly going to parks, museums, and historic sites. I took a trip to Washington DC during the 4th of July weekend and thoroughly enjoyed exploring the National Museum of American History and International Spy Museum during the National Holiday. I've also loved exploring museums in New York City, where I currently live, and my favorite has been the Ellis Island Immigration Museum. I also enjoy reading and watching documentaries about history and politics."
    },
    {
      "category": "About Me",
      "name": "Interest in food and entertainment",
      "details": "I enjoy trying new food items and cuisines, and my favorite food is Street Tacos with chorizo, pastor, and asada. I also enjoy watching sports, particularly the NFL and NBA, as a Chicago fan. I love television dramas and sitcoms - my favorites include Breaking Bad, Game of Thrones, Better Call Saul, The Wire, The Sopranos, The Office, Parks and Recreation, and Modern Family. I enjoy a wide range of rock and old country music - my favorite artists include The Smiths, Fleetwood Mac, ABBA, The Beatles, Elvis Presley, Marty Robbins, Willie Nelson, and Johnny Cash."
    },
    {
      "category": "About Me",
      "name": "U.S Work authorization",
      "details": "Here is information on my authorization to work in the United States. I will begin pursuing an Executive Master of Science in Data Science and Analytics at New England College (NEC) on November 10 2025. This program is designed for working professionals and will allow me to concurrently work full time. As a NEC student, I will be eligible for full-time Curricular Practical Training (CPT) with an earliest possible start date of November 10 2025."
    }
]
  